Autodesk.Revit.DB.ArrayAnchorMember
Represents the possible choices for how the translation or rotation is used to place each member of the array.
Since:
2012

Autodesk.Revit.DB.ArrayAnchorMember.Last
The translation or rotation value specifies the location of the last member of the array.

Autodesk.Revit.DB.ArrayAnchorMember.Second
The translation or rotation value specifies the location of the second member of the array.